#+TITLE: tcp-proxy
#+DATE: 2024-09-01T00:02:43+0800
#+LASTMOD: 2024-09-01T21:05:27+0800
#+TYPE: docs
#+DESCRIPTION: Forward TCP requests hitting a specified port on the localhost to a different port on another host

Both IPv4 and IPv6 are supported. On Linux [[https://man7.org/linux/man-pages/man2/splice.2.html][splice]] is used to improve perf, details can be found [[https://blog.cloudflare.com/sockmap-tcp-splicing-of-the-future/][here]].

#+begin_src bash :results verbatim :exports results :wrap example :dir ../../..
./zig-out/bin/tcp-proxy -h
#+end_src

#+RESULTS:
#+begin_example
 USAGE:
     ./zig-out/bin/tcp-proxy [OPTIONS]

 OPTIONS:
  -b, --bind_host STRING           Local bind host(required)
  -p, --local_port INTEGER         Local bind port(required)
  -H, --remote_host STRING         Remote host(required)
  -P, --remote_port INTEGER        Remote port(required)
      --buf_size INTEGER           Buffer size for tcp read/write(default: 1024)
      --server_threads INTEGER     Server worker threads num(default: 24)
  -h, --help
  -v, --version
      --verbose
#+end_example

#+begin_src bash
tcp-proxy -b 0.0.0.0 -p 8082 -H 192.168.0.2 -P 8082
#+end_src
This will forward tcp requests from =localhost:8082= to =192.168.0.2:8082=

* Benchmark
[[https://iperf.fr/][iPerf3]] is used to benchmark proxy between zigcli and [[https://github.com/kklis/proxy][proxy]], which written in C.
** All in one
- server/client/proxy :: =192.168.31.142=, debian 12
|            | sender | receiver |
|------------+--------+----------|
| zigcli     |   57.2 |     56.9 |
| proxy in C |   56.1 |     55.9 |

- Unit: Gbits/sec
** Server/client separated
- server :: 192.168.31.94, macOS
- proxy/client :: 192.168.31.142, debian 12

|            | sender | receiver |
|------------+--------+----------|
| zigcli     |    191 |      180 |
| proxy in C |    210 |      198 |

- Unit: Mbits/sec

** Commands
#+begin_src bash
# start C proxy in foreground
./proxy -b 0.0.0.0 -l 8081 -h 192.168.31.142 -p 5201 -f
# start tcp-proxy
./zig-out/bin/tcp-proxy -b 0.0.0.0 -p 8080 -H 192.168.31.142 -P 5201

# server
iperf3 -s
# client
iperf3 -c 192.168.31.142 -p 8080/8081
#+end_src
